OpenFOAM-v2506/tutorials/multiphase/overInterDyMFoam/simpleRotor/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    ( 0.00  0.0  0)
    ( 1.00  0.0  0)
    ( 1.00  1.0  0)
    ( 0.00  1.0  0)
    ( 0.00  0.0  1)
    ( 1.00  0.0  1)
    ( 1.00  1.0  1)
    ( 0.00  1.0  1)

    ( 0.15  0.35  0)
    ( 0.85  0.35  0)
    ( 0.85  0.65  0)
    ( 0.15  0.65  0)
    ( 0.15  0.35  1)
    ( 0.85  0.35  1)
    ( 0.85  0.65  1)
    ( 0.15  0.65  1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (36 36 1) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15) movingZone (28 12 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    overset
    {
        type        overset;
        faces
        (
            ( 8 12 15 11)
            (10 14 13  9)
            (11 15 14 10)
            ( 9 13 12  8)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (1 5 4 0)
            (0 4 7 3)
            (2 6 5 1)
        );
    }

    // Populated by subsetMesh
    hole
    {
        type wall;
        faces ();
    }

    top
    {
       type patch;
       faces ((3 7 6 2));
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            ( 8 11 10  9)
            (12 13 14 15)
        );
    }
);


// ************************************************************************* //
